<!-- dflook/terraform-github-actions {"workspace":"hushline-dev-directory-stuff","backend_type":"remote","backend":"abe94e7525b811d404443985e7599afd6e903595e41353dde6310e1247c0c183","plan_job_ref":"Job Deploy/Destroy Branch Dev Environment #143 at https://github.com/scidsg/hushline/actions/runs/10022869431","plan_out_hash":"109482983ac6e63869e382b40c48a97659f74c52cc7f4a412fa25afdf26633a0","plan_hash":"d009433ae2d0f46ca4deb1df9dfdf3684ade4dfa41a8a8a0924f0b406c059cc9","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __terraform/dev__ in the __hushline-dev-directory-stuff__ workspace<details open><summary>With variables</summary>

```hcl
branch = "directory-stuff"
name   = "hushline-dev-directory-stuff"
```
</details>
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # digitalocean_project.hush_line_dev will be created
+   resource "digitalocean_project" "hush_line_dev" {
+       created_at  = (known after apply)
+       description = "Development instance based on the directory-stuff branch"
+       environment = "Development"
+       id          = (known after apply)
+       is_default  = false
+       name        = "hushline-dev-directory-stuff"
+       owner_id    = (known after apply)
+       owner_uuid  = (known after apply)
+       purpose     = "Web Application"
+       resources   = (known after apply)
+       updated_at  = (known after apply)
    }

  # module.app.digitalocean_app.app will be created
+   resource "digitalocean_app" "app" {
+       active_deployment_id = (known after apply)
+       created_at           = (known after apply)
+       default_ingress      = (known after apply)
+       id                   = (known after apply)
+       live_url             = (known after apply)
+       project_id           = (known after apply)
+       updated_at           = (known after apply)
+       urn                  = (known after apply)

+       dedicated_ips (known after apply)

+       spec {
+           domains  = (known after apply)
+           features = [
+               "buildpack-stack=ubuntu-22",
            ]
+           name     = "hushline-dev-directory-stuff"
+           region   = "sfo"

+           alert {
+               disabled = false
+               rule     = "DEPLOYMENT_FAILED"
            }

+           domain (known after apply)

+           ingress (known after apply)

+           service {
+               dockerfile_path    = "Dockerfile"
+               http_port          = 8080
+               instance_count     = 1
+               instance_size_slug = "apps-s-1vcpu-0.5gb"
+               internal_ports     = (known after apply)
+               name               = "app"
+               run_command        = (known after apply)

+               github {
+                   branch         = "directory-stuff"
+                   deploy_on_push = true
+                   repo           = "scidsg/hushline"
                }

+               health_check {
+                   http_path = "/health.json"
                }

+               routes (known after apply)
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   app_live_url = (known after apply)
```
</details>

:memo: Plan generated in [Deploy/Destroy Branch Dev Environment #143](https://github.com/scidsg/hushline/actions/runs/10022869431)